/*
 ---------------------------------------------------------------
    Библиотеки/плагины используемые в проекте:

    - plugin

 ---------------------------------------------------------------
*/

var myModule = (function() {

	// кешируем элементы


	// Инициализируем запуск всех необходимых фукций
	var init = function() {


		// svg4everybody({}); // Плагин для работы svg иконок в разных браузерах

		//-----------------------
		_toggleMenu();

	};
	//-------------------------------------------------------------------

	// Для формирования сетки на странице Фотоальбома
  //-------------------------------------------------------------------
	function _toggleMenu() {
		'use strict';
    $('#toggleMenu, .b-menu__backdrop').on('click touchstart', function (e) {
        $('body').toggleClass('open-menu');
        $('.b-menu .b-menu__collapse, #toggleMenu, .b-menu__backdrop').toggleClass('active');
        e.preventDefault();
    });
	};
  //-------------------------------------------------------------------
	
	



	return {
		init: init
	}

})();

myModule.init();